let handler = async (m, { command, text }) => m.reply(`*⧈─╼━╾╼━┇•🌩️•┇━╾─╼╾─⧈*
*⊚ يرجي تعبئة إستمارة الدخول الى القروب الأساسي ⇓*
*⧈─╼━╾╼━┇•🌩️•┇━╾─╼╾─⧈*
*❍ لــقــبـك ⇜「」*
لقب شخصية الإنمي الذي تحبها 🌸
*الإنــمــــــي⇜「」*
الذي إخترت منه الشخصية 💫
*❍ ولــد أو بنــت ⇜「」*
جنسك ذكر أو أنثى 🧸
*❍ من طـــرف ⇜「」*
*📃من الذي أعطاك الرابط📃↯*
~*ملحوظة:  إذا لا تتذكر يمكن أن تحضر إسكرين 🪄*~
*⧈─╼━╾╼━┇•🌩️•┇━╾─╼╾─⧈*
*مع إرفاق صورة للشخصية إلذي إخترتها 🌌*
*ممنوع إختيار لقب مخالف لجنسك 🫵🏻*
*⧈─╼━╾╼━┇•🌩️•┇━╾─╼╾─⧈*
*┊❄️┊البوت:•⪼𝙰𝚛𝚝_𝚋𝚘𝚝*
*┊❄️┊⇦تـوقـيــــ؏⇇𝙰𝚛𝚝_𝚋𝚘𝚝*`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(0|استقبال|استماره|1)$/i

export default handler